package msg

//---------------------------------------------//
//Сообщения с предупреждениями для логирования.//
// --------------------------------------------//

const (
	WL4000 = "WL4000 Предупреждение: строка пустая."
	WL4001 = "WL4001 Предупреждение: если пробела нет, то вся строка считается кодом."
	WL4002 = "WL4002 Предупреждение: получен сигнал остановки сервера..."
)

// ---------------------------------------------//
//Сообщения с предупреждениями для репозитория.	//
// ---------------------------------------------//

const WRS400 = "ERS400 Ошибка: не удалось найти объект, он равен nil."
